onec-mid-base-11/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаОсновании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

onec-mid-base-11/src/Catalogs/КонтактныеЛица/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    
  
  ЭлементКонтактныйТелефон = Элементы.Вставить("КонтактныйТелефон", Тип ("ПолеФормы"), ,);
  ЭлементКонтактныйТелефон.ПутьКДанным = "Объект.КонтактныйТелефон";
  ЭлементКонтактныйТелефон.Вид = ВидПоляФормы.ПолеВвода;
  ЭлементКонтактныйТелефон.Заголовок = "Контактный Телефон";
  
  ЭлементДолжность = Элементы.Вставить("Должность", Тип ("ПолеФормы"),,);
  ЭлементДолжность.ПутьКДанным = "Объект.Должность";
  ЭлементДолжность.Вид = ВидПоляФормы.ПолеВвода;
  ЭлементДолжность.Заголовок = "Должность"; 
  
  ЭлементДействуетНаОсновании = Элементы.Вставить("ДействуетНаОсновании",Тип ("ПолеФормы"),,);
  ЭлементДействуетНаОсновании.ПутьКДанным = "Объект.ДействуетНаОсновании";
  ЭлементДействуетНаОсновании.Вид = ВидПоляФормы.ПолеВвода;
  ЭлементДействуетНаОсновании.Заголовок = "Действует на основании"; 
  
  ЭлементЗаметки = Элементы.Вставить("Заметки",Тип ("ПолеФормы"),,);
  ЭлементЗаметки.ПутьКДанным = "Объект.Заметки";
  ЭлементЗаметки.Вид = ВидПоляФормы.ПолеВвода;
  ЭлементЗаметки.Заголовок = "Заметки";
  
КонецПроцедуры
